{
    "basic_info": {
      "description_header": "Hola! Perdóname porque el español es mi segundo idioma.",
      "description": "👋 Me llamo Mick Ward. Soy un estudiante de ciencia de computadora en la Universidad de Dayton, y me voy a graduar en Mayo 2022. Estoy interesado en un trabajo con desarrollo o un trabajo de la seguridad cibernética para aplicar mis habilidades que he aprendido en mis clases!",
      "description2": "En UD, soy el presidente de La Asociación para la Maquinaria de Computación. Esta posición, consiste en organización de reuniones semanales, y la creación de la agenda. La contenta del club contiene desarrollo, seguridad cibernética, y todo entremedias. He servido como la presidencia de vóleibol para Red Scare, la sección de estudiantes para deportes en UD. Hemos planeado sorteos y otros incentivos para crear un ambiente eléctrico para las partidas. Competo en el equipo de seguridad cibernética para Dayton, en la Liga Nacional de Ciber. Competemos en dos torneos anuales.",
      "description3": "En mi tiempo libre, disfruto jugando deportes con amigos, y a mi me gusta mucho los videojuegos. Enviarme un correo a wardc11@udayton.edu, y disfruta mi porfolio!",
      "section_name": {
        "about": "Sobre yo",
        "projects": "Proyectos",
        "skills": "Habilidades",
        "experience": "Experiencias"
      }
    },
    "projects": [
      {
        "title": "Matrix Police",
        "startDate": "2021",
        "description": "Matrix Police es la sección de Matrix Pointe Software que yo trabajé la más. Es parte de su software que agiliza el proceso de justicia penal. ¡Estaba desarrollando en un equipo de cuarenta desarrolladores, estaba escribiendo código que está usando en el mundo actual! He podido aprender muchos instrumentos nuevos, y he ganado experiencia con React y TypeScript. Mi código fue revisado por desarrolladores talentosas, y a mí me enseñaban prácticas de código que voy a usar en todo de mi carrera profesional.",
        "images": [
          "images/portfolio/animal-shelter/Matrix.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Facebook Mini",
        "startDate": "2021",
        "description": "Es posible que este proyecto no se vea muy espectacular en el front-end, pero este clon de Facebook fue desarrollado por mi socio y yo en nuestra Clase de Desarrollo de Aplicaciones Seguras. En esta clase, la interfaz pasó a un segundo plano, para que nos concentremos en hacer que el sitio web sea completamente seguro. En la clase, desarrollamos un conocimiento profundo sobre las formas en que los sitios web son atacados y lo usamos para desarrollar aplicaciones desde una mentalidad de seguridad. ¡No dude en seguir el enlace al repositorio para leer todos los principios de seguridad que se aplican a nuestro sitio de redes sociales para que sea seguro!",
        "images": [
          "images/portfolio/photography/registrationdemo.png",
          "images/portfolio/photography/Post.png",
          "images/portfolio/photography/adminaccessonly.png"
        ],
        "url": "https://bitbucket.org/secad-s21-team1/secad-s21-team1-project/src/master/",
        "technologies": [
          {
            "class": "devicon-php-plain",
            "name": "PHP"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySQL"
          }
        ]
      },
      {
        "title": "Actualizaciones de Texto de Covid",
        "startDate": "2020",
        "description": "Este es un proyecto personal que creé para mí y mis amigos en la Universidad de Dayton. Nuestra Universidad tenía un sitio web que proporcionaría actualizaciones diarias sobre casos de covid en el campus. Sin embargo, este sitio web se actualizaría en momentos aparentemente aleatorios, por lo que creé un script que verificaría cuándo se actualizaba el sitio web y luego enviaría mensajes de texto a una lista de personas con la información.",
        "images": [
          "images/portfolio/adventure/updates.jpg"
        ],
        "url": "https://github.com/Mickers247/Covid-Updates/blob/main/README.md",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Matrix Pointe Software",
        "title": "Full Stack Developer Intern",
        "years": "05.2021 - 08.2021",
        "icon": "fab fa-react experience-icon",
        "mainTech": [
          "React con TypeScript"
        ],
        "technologies": [
          "REST API",
          "React",
          "JavaScript",
          "TypeScript",
          "SQL"
        ]
      },
      {
        "company": "Flyer News",
        "title": "Administrador de Web",
        "years": "08.2019 - Present",
        "icon": "fab fa-wordpress experience-icon",
        "mainTech": [
          "WordPress"
        ],
        "technologies": [
          "WordPress",
          "HTML",
          "CSS"
        ]
      },
      {
        "company": "Ingram Micro",
        "title": "Analisto de datos",
        "years": "05.2019 - 08-2019",
        "icon": "fab fa-python experience-icon",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "Excel"
        ]
      },
      {
        "company": "Universidad de Dayton",
        "title": "Computer Science Major",
        "years": "08.2018 - Present",
        "icon": "fas fa-graduation-cap experience-icon",
        "mainTech": [
          "Estudiante"
        ],
        "technologies": [
          "Java",
          "Python",
          "GoLang",
          "PHP",
          "C++",
          "NodeJS",
          "SQL"
        ]
      }
    ]
  }